//напишите программу которая будет выдавать название дня недели по заданному номеру

//3-> среда
Console.WriteLine("Введите число : ");
int a = Convert.ToInt32(Console.ReadLine());

if (a==1)


    Console.WriteLine("это понедельник");


else if(a==2)


    Console.WriteLine("это вторник");

else if(a==3)


    Console.WriteLine("это среда");

else if(a==4)


    Console.WriteLine("это четверг");

else if(a==5)


    Console.WriteLine("это пятница");

else if(a==6)


    Console.WriteLine("это суббота");

else if(a==7)


    Console.WriteLine("это воскресенье");

else Console.WriteLine("Введено некоректное значение");






